//================================================
//포인터 연산
// 포인터 + 정수 :???
//================================================
#include <stdio.h>
int main() {
	/*int no = 1234;
	printf("%d\n", &no);
	printf("%d\n", &no + 1);*/

	char arr[5] = { 1,2,3,4,5 };
	//배열의 이름은 시작위치의 주소값
	//첫번째 요소의 주소값
	//printf("%d\n", arr);
	//printf("%d\n", &arr[0]);
	printf("%d\n", *arr);
	printf("%d\n", *(arr+1));
	printf("%d\n", *(arr+2));
	printf("%d\n", *(arr+3));
	printf("%d\n", *(arr+4));

	int p[3][4];
	//[][][][]
	//[][][7][]
	//[][][][]


	return 0;
}